# FluidType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystemType..::..FluidType Property
PipingSystemType Class See Also
---
Fluid Type
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId FluidType { get; set; }
```

Visual Basic
---
```text
Public Property FluidType As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ FluidType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: fluidTypeId is not a fluid type. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace